jonacappelle/nRF52-DCU/main.c
            // Get connection handles
            ble_conn_state_conn_handle_list_t conn_central_handles = ble_conn_state_central_handles();
            //You can iterate through the list of connection handles:

            NRF_LOG_INFO("conn_central_handles.len %d", conn_central_handles.len);
            for (uint32_t i = 0; i < conn_central_handles.len; i++)
            {
                uint16_t conn_handle = conn_central_handles.conn_handles[i];

                // Print Connected Devices
                uint8_t str[100];
                sprintf(str, "Sensor    %d  --> conn handle  %d\n", (i + 1), conn_handle);
                uart_print(str);
                // NRF_LOG_INFO("Connection handle: %d\n", (i+1), conn_handle);
                nrf_delay_ms(1);
            }

            // uart_print("This feature is in progress...\n");
            uart_print("------------------------------------------\n");

            break;

        case CMD_SYNC:
            NRF_LOG_INFO("CMD_SYNC received");

            // Get byte after sync command
            uint8_t byte2[1];
            err_code = app_fifo_get(&buffer.uart_rx_fifo, byte2);

            switch (byte2[0])
            {
            case CMD_SYNC_ENABLE:
                NRF_LOG_INFO("CMD_SYNC_ENABLE received");

                // Start synchronization
                err_code = ts_tx_start(TIME_SYNC_FREQ_AUTO);
                // err_code = ts_tx_start(2);
                APP_ERROR_CHECK(err_code);
                // ts_gpio_trigger_enable();
                ts_imu_trigger_enable();
                NRF_LOG_INFO("Starting sync beacon transmission!\r\n");

                imu.sync_enabled = 1;

                uart_print("------------------------------------------\n");
                uart_print("Synchonization started.\n");
                uart_print("------------------------------------------\n");

                break;

            case CMD_SYNC_DISABLE:
                NRF_LOG_INFO("CMD_SYNC_DISABLE received");

                // Stop synchronization
                err_code = ts_tx_stop();
                ts_imu_trigger_disable();
                APP_ERROR_CHECK(err_code);
                NRF_LOG_INFO("Stopping sync beacon transmission!\r\n");

                imu.sync_enabled = 0;

                uart_print("------------------------------------------\n");
                uart_print("Synchonization stopped.\n");
                uart_print("------------------------------------------\n");

                break;

            default:
                NRF_LOG_INFO("Invalid character after CMD_SYNC");
                break;
            }

            break;

        case CMD_ADC:
            NRF_LOG_INFO("CMD_ADC received");

            uart_print("------------------------------------------\n");
            uart_print("ADC enabled.\n");
            uart_print("------------------------------------------\n");

            imu.adc = 1;

            break;

        case CMD_GYRO:
            NRF_LOG_INFO("CMD_GYRO received");
            // NRF_LOG_FLUSH();
            imu.gyro_enabled = 1;
            // state = CMD_FREQ;
            break;

        case CMD_ACCEL:
            NRF_LOG_INFO("CMD_ACCEL received");
            // NRF_LOG_FLUSH();
            imu.accel_enabled = 1;
            // state = CMD_FREQ;
            break;

        case CMD_MAG:
            NRF_LOG_INFO("CMD_MAG received");
            // NRF_LOG_FLUSH();
            imu.mag_enabled = 1;
            // state = CMD_FREQ;
            break;

        case CMD_QUAT:
            NRF_LOG_INFO("CMD_QUAT received");
            // NRF_LOG_FLUSH();

            uint8_t byte[1];
            err_code = app_fifo_get(&buffer.uart_rx_fifo, byte);

            switch (byte[0])
            {
            case CMD_QUAT6:
                NRF_LOG_INFO("CMD_QUAT6 received");
                // NRF_LOG_FLUSH();
                imu.quat6_enabled = 1;
                // state = CMD_FREQ;
                break;

            case CMD_QUAT9:
                NRF_LOG_INFO("CMD_QUAT9 received");
                // NRF_LOG_FLUSH();
                imu.quat9_enabled = 1;
                // state = CMD_FREQ;
                break;

            default:
                NRF_LOG_INFO("Invalid character after CMD_QUAT");
                // NRF_LOG_FLUSH();
                break;
            }
            break;

        case CMD_EULER:
            NRF_LOG_INFO("CMD_EULER received");
            // NRF_LOG_FLUSH();
            imu.euler_enabled = 1;
            // state = CMD_FREQ;
            break;

        case CMD_RESET:
            NRF_LOG_INFO("CMD_RESET received");

            uart_print("------------------------------------------\n");
            uart_print("Config reset.\n");
            uart_print("------------------------------------------\n");

            config_reset(&imu);
            break;

        case CMD_FREQ:
        {
            NRF_LOG_INFO("CMD_FREQ");
            // NRF_LOG_FLUSH();

            uint32_t cmd_freq_len = 3;

            uint8_t p_byte1[3];
            err_code = app_fifo_read(&buffer.uart_rx_fifo, p_byte1, &cmd_freq_len);

            // Get frequency components
            if (err_code == NRF_SUCCESS)
            {
                // NRF_LOG_INFO("success");
                // NRF_LOG_FLUSH();
                uint8_t cmd = uart_rx_to_cmd(p_byte1, CMD_FREQ_LEN);
                NRF_LOG_INFO("Frequency received: %d", cmd);
                NRF_LOG_FLUSH();

                switch (cmd)
                {
                case CMD_FREQ_10:
                    NRF_LOG_INFO("CMD_FREQ_10 received");
                    imu.frequency = 10;
                    // NRF_LOG_FLUSH();
                    break;

                case CMD_FREQ_50:
                    NRF_LOG_INFO("CMD_FREQ_50 received");
                    imu.frequency = 50;
                    // NRF_LOG_FLUSH();
                    break;

                case CMD_FREQ_100:
                    NRF_LOG_INFO("CMD_FREQ_100 received");
                    imu.frequency = 100;
                    // NRF_LOG_FLUSH();
                    break;

                case CMD_FREQ_200:
                    NRF_LOG_INFO("CMD_FREQ_200 received");
                    imu.frequency = 200;
                    // NRF_LOG_FLUSH();
                    break;

                case CMD_FREQ_225:
                    NRF_LOG_INFO("CMD_FREQ_225 received");
                    imu.frequency = 225;
                    // NRF_LOG_FLUSH();
                    break;

                default:
                    NRF_LOG_INFO("Invalid character CMD_FREQ");
                    uart_print("Invalid frequency selected!\n");
                    // NRF_LOG_FLUSH();
                    break;
                }
            }
            else
            {
                NRF_LOG_INFO("err_code: %d", err_code);
                NRF_LOG_FLUSH();
            }
        }
        break;

        case CMD_WOM:
            NRF_LOG_INFO("CMD_WOM received");
            uart_print("------------------------------------------\n");
            uart_print("Wake On Motion Enabled.\n");
            uart_print("------------------------------------------\n");

            imu.wom = 1;
            break;

        case CMD_STOP:
            NRF_LOG_INFO("CMD_STOP received");
            uart_print("------------------------------------------\n");
            uart_print("Sampling stopped.\n");
            uart_print("------------------------------------------\n");

