jonacappelle/nRF52-DCU/main.c
            ble_tes_config_t stop_config;
            memset(&stop_config, 0, sizeof(stop_config));

            imu.stop = 1;

            // Send config to peripheral
            for (uint8_t i = 0; i < NRF_SDH_BLE_CENTRAL_LINK_COUNT; i++)
            {
                err_code = ble_tes_config_set(&m_thingy_tes_c[i], &stop_config);
                if (err_code != NRF_SUCCESS)
                {
                    NRF_LOG_INFO("ble_tes_config_set error %d", err_code);
                }
            }

            break;

        case CMD_SEND:

            // Send config
            NRF_LOG_INFO("CMD_CONFIG_SEND received");

            config_send(&imu);

            uart_print("------------------------------------------\n");
            uart_print("Configuration send to peripherals.\n");
            uart_print("------------------------------------------\n");
            break;

        default:
            NRF_LOG_INFO("DEFAULT");
            NRF_LOG_FLUSH();
            uart_print("------------------------------------------\n");
            uart_print("Invalid command.\n");
            uart_print("------------------------------------------\n");
            break;
        }
    }

    nrf_gpio_pin_set(12);
    nrf_delay_ms(500);
    nrf_gpio_pin_clear(12);

    NRF_LOG_INFO("UART CMD detection ended");
    NRF_LOG_FLUSH();
}

void imu_uart_sceduled(void *p_event_data, uint16_t event_size)
{
    while (imu.evt_scheduled > 0)
    {
        uint32_t err_code;

        bool read_success = false;

        // NRF_LOG_INFO("App scheduler execute: %d", imu.evt_scheduled);

        char string[1024];

        received_data_t temp;
        uint32_t temp_len = sizeof(temp);

        float quat[4];
        uint32_t quat_len = sizeof(quat);

        if (app_fifo_read(&buffer.received_data_fifo, (uint8_t *)&temp, &temp_len) == NRF_SUCCESS)
        {
            // sprintf(string, "%d w%.3fwa%.3fab%.3fbc%.3fc\n", device_nr[0], quat[0], quat[1], quat[2], quat[3]);

            // If packet contains QUATERNIONS
            if (temp.quat_data_present)
            {
                sprintf(string, "%d Q   %.3f    %.3f    %.3f    %.3f\n", temp.conn_handle, temp.quat_data.w, temp.quat_data.x, temp.quat_data.y, temp.quat_data.z);
            }
            else
                // if packet contains RAW DATA
                if (temp.raw_data_present)
            {
                sprintf(string, "%d G %.3f %.3f %.3f        A %.3f %.3f %.3f        M %.3f %.3f %.3f\n", temp.conn_handle, temp.raw_data.gryo.x, temp.raw_data.gryo.y, temp.raw_data.gryo.z, temp.raw_data.accel.x, temp.raw_data.accel.y, temp.raw_data.accel.z, temp.raw_data.mag.x, temp.raw_data.mag.y, temp.raw_data.mag.z);
            }
            else
                // If packet contains ADC DATA
                if (temp.adc_data_present)
            {
                sprintf(string, "%d ADC %.3f\n", temp.conn_handle, temp.adc_data.raw[0]);
                NRF_LOG_INFO("To be implemented.");
            }

            read_success = true;
            imu.evt_scheduled--;
        }

        // Get data from FIFO buffer if data is correctly recognized
        if (read_success)
        {
            uint32_t string_len = 0;
            do
            {
                string_len++;
            } while (string[string_len] != '\n');
            string_len++;

            // Put the data in FIFO buffer
            err_code = app_fifo_write(&buffer.uart_dma_difo, (uint8_t *)string, &string_len);
            if (err_code == NRF_ERROR_NO_MEM)
            {
                NRF_LOG_INFO("UART FIFO BUFFER FULL!");
            }

            if (err_code == NRF_SUCCESS)
            {
                //								NRF_LOG_INFO("Data in FIFO");
                // The new byte has been added to FIFO. It will be picked up from there
                // (in 'uart_event_handler') when all preceding bytes are transmitted.
                // But if UART is not transmitting anything at the moment, we must start
                // a new transmission here.
                if (!nrf_drv_uart_tx_in_progress(&imu.uart))
                {
                    //										NRF_LOG_INFO("TX not in progress");
                    // This operation should be almost always successful, since we've
                    // just added a byte to FIFO, but if some bigger delay occurred
                    // (some heavy interrupt handler routine has been executed) since
                    // that time, FIFO might be empty already.
                    if (app_fifo_read(&buffer.uart_dma_difo, buffer.uart_dma_tx_buff, &string_len) == NRF_SUCCESS)
                    {
                        //												NRF_LOG_INFO("FIFO read");
                        // if(uart_free)
                        // {
                        do
                        {
                            err_code = nrf_drv_uart_tx(&imu.uart, buffer.uart_dma_tx_buff, (uint8_t)string_len);
                            if ((err_code != NRF_SUCCESS) && (err_code != NRF_ERROR_BUSY))
                            {
                                NRF_LOG_ERROR("nrf_drv_uart_tx failed");
                                APP_ERROR_CHECK(err_code);
                            }
                        } while (err_code == NRF_ERROR_BUSY);
                        //												NRF_LOG_INFO("UART TX OK");
                        // }
                    }
                }
            }
        }
    }
}

// Event handler DIY
void data_evt_sceduled(void *p_event_data, uint16_t event_size)
{
    nrf_gpio_pin_set(22);
    uint32_t err_code;

    while (imu.evt_scheduled > 0)
    {
        NRF_LOG_INFO("App scheduler execute: %d", imu.evt_scheduled);
        NRF_LOG_FLUSH();

        uint32_t classification_byte_len = 1;
        uint8_t classification_byte[classification_byte_len];

        bool read_success = false;
        uint32_t temp_len;
        float quat[4];
        float other[3];
        char string_send[200];

        // Get 1 byte from buffer to determine which sort of data we are dealing with
        if (app_fifo_read(&buffer.received_data_fifo, classification_byte, &classification_byte_len) == NRF_SUCCESS)
        {
            switch (classification_byte[0])
            {
            case ENABLE_QUAT6:
                // Get 4 floats
                temp_len = 4 * sizeof(float);
                // NRF_LOG_INFO("temp_len: %d", temp_len);
                if (app_fifo_read(&buffer.received_data_fifo, (uint8_t *)quat, &temp_len) == NRF_SUCCESS)
                {
                    NRF_LOG_INFO("Read QUAT6");
                    NRF_LOG_INFO("%d %d %d %d", 1000 * quat[0], 1000 * quat[1], 1000 * quat[2], 1000 * quat[3]);
                    read_success = true;
                    sprintf(string_send, "w%.2fwa%.2fab%.2fbc%.2fc\n", quat[0], quat[1], quat[2], quat[3]);
                    NRF_LOG_INFO("%s", string_send);
                }
                break;
            case ENABLE_QUAT9:
                // Get 4 floats
                temp_len = 4 * sizeof(float);
                // NRF_LOG_INFO("temp_len: %d", temp_len);
                if (app_fifo_read(&buffer.received_data_fifo, (uint8_t *)quat, &temp_len) == NRF_SUCCESS)
                {
                    NRF_LOG_INFO("Read QUAT9");
                    NRF_LOG_INFO("%d %d %d %d", 1000 * quat[0], 1000 * quat[1], 1000 * quat[2], 1000 * quat[3]);
                    read_success = true;
                    sprintf(string_send, "w%fwa%fab%fbc%fc\n", quat[0], quat[1], quat[2], quat[3]);
                    NRF_LOG_INFO("%s", string_send);
                }
                break;
            case ENABLE_EULER:
                // Get 3 floats
                temp_len = 3 * sizeof(float);
                if (app_fifo_read(&buffer.received_data_fifo, (uint8_t *)other, &temp_len) == NRF_SUCCESS)
                {
                    NRF_LOG_INFO("Read EULER");
                    read_success = true;
                    // Convert to string
                    sprintf(string_send, "Euler: x: %f	y: %f	z: %f\n", other[0], other[1], other[2]);
                }
                break;
            case ENABLE_GYRO:
                // Get 3 floats
                temp_len = 3 * sizeof(float);
                if (app_fifo_read(&buffer.received_data_fifo, (uint8_t *)other, &temp_len) == NRF_SUCCESS)
                {
                    NRF_LOG_INFO("Read GYRO");
                    read_success = true;
                    // Convert to string
                    sprintf(string_send, "Gyro: x: %.2f	y: %.2f	z: %.2f\n", other[0], other[1], other[2]);
                }
                break;
            case ENABLE_ACCEL:
                // Get 3 floats
                temp_len = 3 * sizeof(float);
                if (app_fifo_read(&buffer.received_data_fifo, (uint8_t *)other, &temp_len) == NRF_SUCCESS)
                {
                    NRF_LOG_INFO("Read ACC");
                    read_success = true;
                    // Convert to string
                    sprintf(string_send, "Acc: x: %.2f	y: %.2f	z: %.2f\n", other[0], other[1], other[2]);
                }
                break;
            case ENABLE_MAG:
                // Get 3 floats
                temp_len = 3 * sizeof(float);
                if (app_fifo_read(&buffer.received_data_fifo, (uint8_t *)other, &temp_len) == NRF_SUCCESS)
                {
                    NRF_LOG_INFO("Read MAG");
                    read_success = true;
                    // Convert to string
                    sprintf(string_send, "Mag: x: %f	y: %f	z: %f\n", other[0], other[1], other[2]);
                }
                break;
            default:
                // in case of error
                NRF_LOG_INFO("Error detecting classification_byte: %X", classification_byte[0]);
                break;
            }
        }

        // Get data from FIFO buffer if data is correctly recognized
        if (read_success)
        {

            // NRF_LOG_INFO("read_success");
            // NRF_LOG_FLUSH();

            uint32_t string_len = 0;
            do
            {
                string_len++;
            } while (string_send[string_len] != '\n');
            string_len++;

            // Put the data in FIFO buffer
            err_code = app_fifo_write(&buffer.uart_dma_difo, (uint8_t *)string_send, &string_len);
            if (err_code == NRF_ERROR_NO_MEM)
            {
                NRF_LOG_INFO("UART FIFO BUFFER FULL!");
            }

            if (err_code == NRF_SUCCESS)
            {
                //								NRF_LOG_INFO("Data in FIFO");
                // The new byte has been added to FIFO. It will be picked up from there
                // (in 'uart_event_handler') when all preceding bytes are transmitted.
                // But if UART is not transmitting anything at the moment, we must start
                // a new transmission here.
                if (!nrf_drv_uart_tx_in_progress(&imu.uart))
                {
                    //										NRF_LOG_INFO("TX not in progress");
                    // This operation should be almost always successful, since we've
                    // just added a byte to FIFO, but if some bigger delay occurred
                    // (some heavy interrupt handler routine has been executed) since
                    // that time, FIFO might be empty already.
                    if (app_fifo_read(&buffer.uart_dma_difo, buffer.uart_dma_tx_buff, &string_len) == NRF_SUCCESS)
                    {
                        //												NRF_LOG_INFO("FIFO read");
                        do
                        {
                            err_code = nrf_drv_uart_tx(&imu.uart, buffer.uart_dma_tx_buff, (uint8_t)string_len);
                            if ((err_code != NRF_SUCCESS) && (err_code != NRF_ERROR_BUSY))
                            {
                                NRF_LOG_ERROR("nrf_drv_uart_tx failed");
                                APP_ERROR_CHECK(err_code);
                            }
                        } while (err_code == NRF_ERROR_BUSY);
                        //												NRF_LOG_INFO("UART TX OK");
                    }
                }
            }
            imu.evt_scheduled--; // Needs to be here: problem: can skip some malformed packets - otherwise the app_scheduler will continue to execute and block the cpu
        }
    }
    nrf_gpio_pin_clear(22);
}

/**@brief NUS UUID. */
static ble_uuid_t const m_nus_uuid =
    {
        .uuid = BLE_UUID_NUS_SERVICE,
        .type = NUS_SERVICE_UUID_TYPE};

/**@brief Function for handling asserts in the SoftDevice.
 *
 * @details This function is called in case of an assert in the SoftDevice.
 *
 * @warning This handler is only an example and is not meant for the final product. You need to analyze
 *          how your product is supposed to react in case of assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num     Line number of the failing assert call.
 * @param[in] p_file_name  File name of the failing assert call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t *p_file_name)
{
    app_error_handler(0xDEADBEEF, line_num, p_file_name);
}

/**@brief Function for handling the Nordic UART Service Client errors.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void nus_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}

/**@brief Function to start scanning. */
static void scan_start(void)
{
    ret_code_t ret;

    ret = nrf_ble_scan_start(&m_scan);
    APP_ERROR_CHECK(ret);

