jonacappelle/nRF52-DCU/main.c
    switch (event)
    {
    // TimeSync begin
    case BSP_EVENT_KEY_0:
    {
        //     static bool m_send_sync_pkt = false;

        //     if (m_send_sync_pkt)
        //     {
        //         m_send_sync_pkt = false;
        //         m_gpio_trigger_enabled = false;

        //         // bsp_board_leds_off();

        //         err_code = ts_tx_stop();
        //         APP_ERROR_CHECK(err_code);

        //         NRF_LOG_INFO("Stopping sync beacon transmission!\r\n");
        //     }
        //     else
        //     {
        //         m_send_sync_pkt = true;

        //         // bsp_board_leds_on();

        //         APP_ERROR_CHECK(err_code);
        //         // err_code = ts_tx_start(TIME_SYNC_FREQ_AUTO);
        //         err_code = ts_tx_start(2);

        //         // ts_gpio_trigger_enable();
        //         ts_imu_trigger_enable();

        //         NRF_LOG_INFO("Starting sync beacon transmission!\r\n");
        //     }

        // Clear config and send it: Stop measurements
        config_reset(&imu);
        config_send(&imu);

        NRF_LOG_INFO("BSP KEY 0: SENSORS STOP!");
    }
    break;
        // TimeSync end

    case BSP_EVENT_KEY_1:
    {
        // uint8_t temp_config1[] = {ENABLE_GYRO, ENABLE_ACCEL, ENABLE_QUAT6};
        // config_imu(temp_config1, sizeof(temp_config1));
        // break;
    }
    case BSP_EVENT_KEY_2:
    {
        // uint8_t temp_config3[] = {ENABLE_GYRO, ENABLE_ACCEL};
        // config_imu(temp_config3, sizeof(temp_config3));
        // break;
    }
    case BSP_EVENT_KEY_3:
    {
        uint64_t time_ticks;
        uint32_t time_usec;

        time_ticks = ts_timestamp_get_ticks_u64();
        time_usec = TIME_SYNC_TIMESTAMP_TO_USEC(time_ticks);

        NRF_LOG_INFO("Timestamp: %d us (%d, %d)", time_usec, time_usec / 1000000, time_usec / 1000);
        break;
    }
    case BSP_EVENT_SLEEP:
        nrf_pwr_mgmt_shutdown(NRF_PWR_MGMT_SHUTDOWN_GOTO_SYSOFF);
        break;

    case BSP_EVENT_DISCONNECT:

        /* CHANGES
						err_code = sd_ble_gap_disconnect(m_ble_nus_c.conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            if (err_code != NRF_ERROR_INVALID_STATE)
            {
                APP_ERROR_CHECK(err_code);
            }
				END CHANGES */

        for (int c = 0; c < NRF_SDH_BLE_CENTRAL_LINK_COUNT; c++)
        {
            err_code = sd_ble_gap_disconnect(m_ble_nus_c[c].conn_handle,
                                             BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
            if (err_code != NRF_ERROR_INVALID_STATE)
            {
                APP_ERROR_CHECK(err_code);
            }
        }
        /* END CHANGES */

        break;

    default:
        break;
    }
}

/**@brief Function for initializing the UART. */
static void uart_init(void)
{
    ret_code_t err_code;

    app_uart_comm_params_t const comm_params =
        {
            .rx_pin_no = RX_PIN_NUMBER, //26,//RX_PIN_NUMBER,//26
            .tx_pin_no = TX_PIN_NUMBER, //27,//TX_PIN_NUMBER,//27
            .rts_pin_no = RTS_PIN_NUMBER,
            .cts_pin_no = CTS_PIN_NUMBER,
            .flow_control = APP_UART_FLOW_CONTROL_DISABLED,
            .use_parity = false,
            .baud_rate = UART_BAUDRATE_BAUDRATE_Baud115200};

    APP_UART_FIFO_INIT(&comm_params,
                       UART_RX_BUF_SIZE,
                       UART_TX_BUF_SIZE,
                       uart_event_handle,
                       APP_IRQ_PRIORITY_LOWEST,
                       err_code);

    APP_ERROR_CHECK(err_code);
}

/**@brief Function for initializing the Nordic UART Service (NUS) client. */
static void nus_c_init(void)
{
    ret_code_t err_code;
    ble_nus_c_init_t init;

    init.evt_handler = ble_nus_c_evt_handler;
    init.error_handler = nus_error_handler;
    init.p_gatt_queue = &m_ble_gatt_queue;

    /* CHANGES
    err_code = ble_nus_c_init(&m_ble_nus_c, &init);
    APP_ERROR_CHECK(err_code);
	END CHANGES */
    for (int c = 0; c < NRF_SDH_BLE_CENTRAL_LINK_COUNT; c++)
    {
        err_code = ble_nus_c_init(&m_ble_nus_c[c], &init);
        APP_ERROR_CHECK(err_code);
    }
    /* END CHANGES */
}

/**@brief Function for initializing buttons and leds. */
static void buttons_leds_init(void)
{
    ret_code_t err_code;
    bsp_event_t startup_event;

    // err_code = bsp_init(BSP_INIT_LEDS, bsp_event_handler);

    // TimeSync begin
    err_code = bsp_init(BSP_INIT_LEDS | BSP_INIT_BUTTONS, bsp_event_handler);
    // TimeSync end

    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for initializing the timer. */
static void timer_init(void)
{
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for initializing the nrf log module. */
static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}

/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}

/** @brief Function for initializing the database discovery module. */
static void db_discovery_init(void)
{
    ble_db_discovery_init_t db_init;

    memset(&db_init, 0, sizeof(ble_db_discovery_init_t));

    db_init.evt_handler = db_disc_handler;
    db_init.p_gatt_queue = &m_ble_gatt_queue;

    ret_code_t err_code = ble_db_discovery_init(&db_init);
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for handling the idle state (main loop).
 *
 * @details Handles any pending log operations, then sleeps until the next event occurs.
 */
static void idle_state_handle(void)
{
    if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();
    }
}

/////////////// LED BUTTON BLINK /////////////////////
void in_pin_handler(nrf_drv_gpiote_pin_t pin, nrf_gpiote_polarity_t action)
{
    nrf_drv_gpiote_out_toggle(PIN_OUT);

    /* CHANGES */

    NRF_LOG_INFO("BUTTON PRESS");

    /* END CHANGES */
}

char const *phy_str(ble_gap_phys_t phys)
{
    static char const *str[] =
        {
            "1 Mbps",
            "2 Mbps",
            "Coded",
            "Unknown"};

